benchmark-output/outputLoad-e-100000.log
2021-05-11 15:28:53:734 0 sec: 0 operations; est completion in 0 second 
2021-05-11 15:29:03:663 10 sec: 17204 operations; 1720.23 current ops/sec; est completion in 49 seconds [INSERT AverageLatency(us)=568.62] 
2021-05-11 15:29:13:663 20 sec: 35018 operations; 1781.58 current ops/sec; est completion in 38 seconds [INSERT AverageLatency(us)=556.26] 
2021-05-11 15:29:23:663 30 sec: 52873 operations; 1785.5 current ops/sec; est completion in 27 seconds [INSERT AverageLatency(us)=554.96] 
2021-05-11 15:29:33:663 40 sec: 70850 operations; 1797.7 current ops/sec; est completion in 17 seconds [INSERT AverageLatency(us)=552.17] 
2021-05-11 15:29:43:663 50 sec: 88692 operations; 1784.2 current ops/sec; est completion in 7 second [INSERT AverageLatency(us)=557.23] 
2021-05-11 15:29:49:897 56 sec: 100000 operations; 1813.63 current ops/sec; [CLEANUP AverageLatency(us)=403] [INSERT AverageLatency(us)=548.16] 
[OVERALL], RunTime(ms), 56235
[OVERALL], Throughput(ops/sec), 1778.2519783053258
[TOTAL_GCS_G1_Young_Generation], Count, 11
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 26
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.04623455143593847
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 11
[TOTAL_GC_TIME], Time(ms), 26
[TOTAL_GC_TIME_%], Time(%), 0.04623455143593847
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 403.0
[CLEANUP], MinLatency(us), 403
[CLEANUP], MaxLatency(us), 403
[CLEANUP], 0, 403.0
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 556.67498
[INSERT], MinLatency(us), 177
[INSERT], MaxLatency(us), 17323
[INSERT], Return=OK, 100000
[INSERT], 0, 708.6814545454546
[INSERT], 1000, 501.9457128361238
[INSERT], 2000, 559.7347751849744
[INSERT], 3000, 571.2258251302837
[INSERT], 4000, 595.7997594708359
[INSERT], 5000, 545.6620803522289
[INSERT], 6000, 548.7720465890183
[INSERT], 7000, 557.7041619797525
[INSERT], 8000, 552.3870786516854
[INSERT], 9000, 594.470447761194
[INSERT], 10000, 556.2645413870246
[INSERT], 11000, 543.2515068493151
[INSERT], 12000, 610.4987684729064
[INSERT], 13000, 546.6817429674572
[INSERT], 14000, 552.1788300835655
[INSERT], 15000, 563.9003984063745
[INSERT], 16000, 513.4208614426569
[INSERT], 17000, 561.7562358276645
[INSERT], 18000, 559.936194240542
[INSERT], 19000, 549.9311493614658
[INSERT], 20000, 554.2196757965344
[INSERT], 21000, 552.5803021824287
[INSERT], 22000, 551.8270300333704
[INSERT], 23000, 560.772933182333
[INSERT], 24000, 499.1764705882353
[INSERT], 25000, 549.9350721420644
[INSERT], 26000, 553.6085985482971
[INSERT], 27000, 582.0710928319623
[INSERT], 28000, 602.7729762629336
[INSERT], 29000, 566.1817142857143
[INSERT], 30000, 567.0194619347453
[INSERT], 31000, 545.4697136563876
[INSERT], 32000, 566.0342857142857
[INSERT], 33000, 558.1441441441441
[INSERT], 34000, 560.3037831733484
[INSERT], 35000, 553.6
[INSERT], 36000, 538.7056910569106
[INSERT], 37000, 545.4035087719299
[INSERT], 38000, 559.8412162162163
[INSERT], 39000, 523.7535545023696
[INSERT], 40000, 545.1425438596491
[INSERT], 41000, 544.3661740558292
[INSERT], 42000, 558.5393258426966
[INSERT], 43000, 570.732644865175
[INSERT], 44000, 561.1732505643341
[INSERT], 45000, 538.6850948509485
[INSERT], 46000, 549.9983416252073
[INSERT], 47000, 534.1618279569892
[INSERT], 48000, 564.320840431573
[INSERT], 49000, 612.8056930693069
[INSERT], 50000, 510.54759467758447
[INSERT], 51000, 524.6163588390501
[INSERT], 52000, 577.3838559814169
[INSERT], 53000, 562.5531674208145
[INSERT], 54000, 560.4644870349492
[INSERT], 55000, 556.9507002801121
[INSERT], 56000, 569.3613445378152