benchmark-output/outputRun-e-10000.log
2021-05-11 15:27:46:456 0 sec: 0 operations; est completion in 0 second 
2021-05-11 15:27:46:581 0 sec: 1000 operations; 5347.59 current ops/sec; [SCAN-FAILED AverageLatency(us)=34.88] [CLEANUP AverageLatency(us)=784] [INSERT AverageLatency(us)=796.68]  
[OVERALL], RunTime(ms), 189
[OVERALL], Throughput(ops/sec), 5291.005291005291
[TOTAL_GCS_G1_Young_Generation], Count, 1
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 8
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 4.232804232804233
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 1
[TOTAL_GC_TIME], Time(ms), 8
[TOTAL_GC_TIME_%], Time(%), 4.232804232804233
[SCAN-FAILED], Operations, 953
[SCAN-FAILED], AverageLatency(us), 34.8803777544596
[SCAN-FAILED], MinLatency(us), 4
[SCAN-FAILED], MaxLatency(us), 1276
[SCAN-FAILED], 0, 34.8803777544596
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 784.0
[CLEANUP], MinLatency(us), 784
[CLEANUP], MaxLatency(us), 784
[CLEANUP], 0, 784.0
[INSERT], Operations, 47
[INSERT], AverageLatency(us), 796.6808510638298
[INSERT], MinLatency(us), 422
[INSERT], MaxLatency(us), 12069
[INSERT], Return=OK, 47
[INSERT], 0, 796.6808510638298
[SCAN], Operations, 0
[SCAN], AverageLatency(us), NaN
[SCAN], MinLatency(us), -1
[SCAN], MaxLatency(us), -1
[SCAN], Return=ERROR, 953
[SCAN], 0, NaN